In [6]:
import pandas as pd 
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
my_series = pd.Series([4,8,15,16,23,42])
my_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.
a = [1,2,3,4,5,6,7,8,9]
series_1 = pd.Series([a])
series_1

0    [1, 2, 3, 4, 5, 6, 7, 8, 9]
dtype: object

In [8]:
#3
data = [["Alice", 25, "Female"],["Bob", 30, "Male"], ['Claire', 27, 'Female']]
df = pd.DataFrame(data , columns = ["Name", "Age", "Gender"])
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [13]:
'''Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.'''
'''ANS. DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. 
The DataFrame actually consists of Index objects for the axes labels (row and column labels) and Series
objects for the column data
eg. '''
a = [[1,"hitesh"], [2, "Krishna"], [3,"Ram"], [4,'Sudesh'], [5, "kapil"]]
b = pd.DataFrame(a, columns = ['number', 'name'])
b

   number     name
0       1   hitesh
1       2  Krishna
2       3      Ram
3       4   Sudesh
4       5    kapil

In [14]:
'''Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?'''
'''converting data in Data Frame - pd.DataFrame(data, columns)
df.query()
df.insert(value_1, val_2,...)
df.loc()
'''

'converting data in Data Frame - pd.DataFrame(data, columns)\ndf.query()'

In [ ]:
'''Q6. Which of the following is mutable in nature Series, DataFrame, Panel?''
#All Panel, DataFrame, Series are mutable.

In [15]:
'''Q7. Create a DataFrame using multiple Series. Explain with an example.'''

#Importing Pandas library
import pandas as pd
 
#Creating two lists
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]
#Creating two Series by passing lists
auth_series = pd.Series(author)
article_series = pd.Series(article)
#Creating a dictionary by passing Series objects as values
frame = { 'Author': auth_series, 'Article': article_series }
#Creating DataFrame by passing Dictionary
result = pd.DataFrame(frame)
#Printing elements of Dataframe
print(result)

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178